{
    "nav": [
        {
            "name": "About",
            "href": "#about"
        },
        {
            "name": "Skills",
            "href": "#skills"
        },
        {
            "name": "Experience",
            "href": "#experience"
        },
        {
            "name": "Education",
            "href": "#education"
        },
        {
            "name": "Projects",
            "href": "#projects"
        },
        {
            "name": "Contact",
            "href": "#contact"
        }
    ],
    "name": "Sahil Kumar",
    "desination": "Frontend Web Developer",
    "socialLinks": {
        "twitter": "twitter",
        "facebook": "facebook",
        "instagram": "instagram",
        "github": "github"
    },
    "bio": "<p>Hello! I’m Sahil Kumar. I am passionate about Frontend Web Development with 1+ years of focused experience in ReactJs/NextJs applications with expertise in reviewing client requirement prioritizes requirements and baseline project plan. I am a skilled <strong>Frontend web developer</strong> and master of popular JavaScript frameworks ReactJs. I am a quick learner and a team worker that gets the job done.</p><p></p>",
    "dob": "2000-10-25",
    "email": "sahilkumar0005a@gmail.com",
    "skype": "live:sahilkumar0005a",
    "mobile": "+91 93562-90005",
    "address": "Sector 77, Mohali, Punjab, India.",
    "skills": [
        {
            "name": "React Js",
            "level": "Master",
            "precentage": 90
        },
        {
            "name": "Next Js",
            "level": "Master",
            "precentage": 90
        },
        {
            "name": "Node Js",
            "level": "Master",
            "precentage": 70
        },
        {
            "name": "UI/UX",
            "level": "Master",
            "precentage": 70
        },
        {
            "name": "Rest API's",
            "level": "Master",
            "precentage": 90
        },
        {
            "name": "GitFlow",
            "level": "Master",
            "precentage": 90
        },
        {
            "name": "JavaScript",
            "level": "Master",
            "precentage": 80
        },
        {
            "name": "HMTL",
            "level": "Master",
            "precentage": 69
        },
        {
            "name": "CSS",
            "level": "Master",
            "precentage": 69
        }
    ],
    "workExperience": [
        {
            "desination": "Software Developer",
            "company": "Tech Prastish Software Solutions Pvt. Ltd.",
            "from": "April, 2022",
            "to": "Nov,2023",
            "jobDescription": "<ul> <li>I have amassed valuable experience in creating robust and dynamic web applications. With a deep understanding of React's ecosystem and its associated libraries, I have successfully designed and implemented user-friendly and responsive interfaces that have enhanced the user experience</li><li>Learned integrating RESTful APIs and third-party services that has enabled seamless data exchange and improved application functionality.</li> <li>Collaborated effectively within cross-functional teams, I have demonstrated strong problem-solving abilities, ensuring smooth project execution and delivery.</li> <li>Manage user feedback and perform system checkups to ensure the functionality of the website.</li> <li>Manage user feedback and perform system checkups to ensure the functionality of the website.</li> </ul>"
        },
        {
            "desination": "Full Stack (MERN)",
            "company": "Techlive Solutions",
            "from": "August, 2021",
            "to": "January, 2022",
            "jobDescription": "<ul> <li>During my internship as a React developer, I gained valuable hands-on experience working on web application development projects.</li><li>Collaborating with a team of experienced developers, I actively contributed to building and enhancing various React components and features.</li> <li>Through this internship, I honed my skills in front-end development, utilizing React's component-based architecture to create responsive and user-friendly interfaces. I also gained proficiency in implementing state management techniques, such as Redux, to effectively manage and share application data.</li> <li> Additionally, I had the opportunity to integrate APIs and external libraries, further expanding my knowledge of React's ecosystem.</li> <li>My time as a React developer intern not only solidified my technical capabilities but also improved my ability to work collaboratively in a fast-paced development environment.</li> </ul>"
        }
    ],
    "education": [
        {
            "degree": "Bachelor of Computer Science",
            "university": "Chandigarh Group of Colleges",
            "from": "June, 2018",
            "to": "June, 2022",
            "description": ""
        },
        {
            "degree": "Senior Secondary Education",
            "university": "PSEB",
            "from": "March, 2017",
            "to": "March, 2018",
            "description": ""
        },
        {
            "degree": "Matriculation Education",
            "university": "CBSE",
            "from": "March, 2015",
            "to": "March, 2016",
            "description": ""
        }
    ],
    "projects": [
        {
            "name": "Picha Stock Applications",
            "description": "PichaStock is an online platform aimed at providing a diverse collection of high-quality stock photos, illustrations, vectors, and videos to users worldwide. The website serves as a marketplace for photographers, artists, and content creators to showcase and sell their work, while also offering a seamless browsing and purchasing experience for customers.I implemented a seamless photo uploading functionality using AWS S3, facilitating users to upload their photos and videos in an optimized manner. Collaborating closely with business and marketing teams, I developed tailored technical solutions and crafted custom scripts for automation, significantly enhancing operational efficiency. Additionally, I architected the entire payment UI and seamlessly integrated PayPal and Stripe, resulting in a frictionless payment experience that contributed to efficient and satisfying customer interactions. Furthermore, I developed a comprehensive Dashboard for Contributors, allowing them to manage contributed content, orders, and views effectively. Moreover, I designed a specialized Panel for users, enabling them to access their order history and download invoices conveniently. Implementing workflows to track ongoing tasks, I facilitated efficient team collaboration and contributed to designing solutioning documents for each task. Serving as the Frontend Lead, I oversaw the development and redesign of PichaStock.com, introducing features to facilitate the sale of licenses for photos and videos, thereby enhancing revenue streams. Additionally, I addressed internal team challenges by building intuitive Dashboard interfaces, which streamlined processes and significantly improved productivity across all teams.",
            "skills": "ReactJs, Javascript, HTML, Custom CSS,AWS S3 Buckets,AWS Lambda Functions"
        },
        {
            "name": "OneOBilling Application",
            "description": "OneoBilling is a modern and intuitive billing and invoicing platform designed to streamline financial management processes for businesses of all sizes. The website serves as the gateway for users to access OneoBilling's comprehensive suite of features, including invoicing, payment processing, expense tracking, and reporting functionalities.primary responsibility will be to create a user-friendly and visually appealing web interface that enhances the overall user experience. You will work closely with the design and backend development teams to implement responsive and interactive frontend components using HTML, CSS, and JavaScript.",
            "skills": "AngularJs, Typescript, HTML, CSS"
        }
    ]
    
}